[
    {
        "topic": "GoFR",
        "description": "GoFR is a framework that enables the rapid development of web applications. Your task is to explore how GoFR can be enhanced to support the development of more complex and feature-rich applications. This could involve improving the framework's scalability, performance, security, or usability, as well as adding new features and functionalities to better meet the needs of developers and users."
    },
    {
        "topic": "Blockchain",
        "description": "Blockchain is a technology that enables secure, transparent, and tamper-proof transactions. Your task is to come up with solutions to enhance the GoFr framework, making it better suited for building Blockchain applications"
    },
    {
        "topic": "AI and language",
        "description": "Your task is to explore how AI can be used to help users easily adapt to a new language. Develop solutions that integrate AI to make language learning intuitive and personalised, using real-time feedback and adapting to individual learning styles for more efficient and effective language acquisition"
    },
    {
        "topic": "FinTech",
        "description": "The fintech industry combines finance and technology to create innovative solutions that improve the efficiency, security, and accessibility of financial services. Develop ideas that address key challenges like secure payments, fraud prevention, financial accessibility, or seamless transaction processing, while delivering efficient and reliable financial solutions for users"
    },
    {
        "topic": "Sustainability",
        "description": "Identify and propose solutions to improve the sustainability of university campuses. This includes addressing waste management, promoting eco-friendly practices, and encouraging student engagement in environmental initiatives. Your challenge is to create innovative strategies that not only reduce the campus's ecological footprint but also foster a culture of sustainability among students and staff."
    }
]